[
  {
    "f": "Когда создается SGA (один ответ)",
    "a": [
      "при запуске экземпляра"
    ],
    "v": [
      "при старте серверного процесса",
      "при монтировании бд",
      "при запуске пользвательского процесса",
      "при создании бд"
    ]
  },
  {
    "f": "Укажите 2 верных утверждения о представлениях словаря данных с префиксом user_(несколько ответов)",
    "a": [
      "Пользователи, которые имеют системную привелегию create public synonym могут создавать общедоступные синонимы для этих представлений",
      "Столбец owner содержит информацию о текущем пользователе"
    ],
    "v": [
      "Пользователи могут выполнять insert к этим представлениям для того, чтобы изменить значения в соответствующих таблицах",
      "Определения этих представлений хранятся в ТП пользователя по умолчанию",
      "Пользователь должен иметь привелегию select any table для просмотра этих представлений",
      "Эти представления содержат информацию обо всех объектах, к которым у юзера есть доступ"
    ]
  },
  {
    "f": "- Вы обнаружили следующую запись в alert.log\n\nTue May 27 17:41:58 2014\n\nORA-00060: Deadlock detected. More info in file /u01/app/oracle/admin/ORCL/udump/orcl_ora_2170.trc\n\nЧто сделать, чтобы убедиться в корректной работе бд?",
    "a": [
      "Исследовать указаный трассировочный файл для получения более детальной информации и попросить юзера, вызыввшего взаимную блокировку откатить транзакцию"
    ],
    "v": [
      "Исследовать указанный трассировочный файл и убить обе сессии, виновные в блокировке",
      "Исследовать трассировочный файл и убить сессию, вызвавшую взаимую блокировку",
      "Исследовать указаный трассировочный файл для получения более детальной информации и убедиться, что взаимная блокировка была разрешена автоматичекими средставми оракла",
      "Исследовать указаный трассировочный файл для получения более детальной информации и затем использовать советчик undo advisor для отката транзакции, вызвавшей взаимную блокировку"
    ]
  },
  {
    "f": "Вы начали длительную транзакцию. Перед сохранением (commit), вы сделали запрос к таблице, в которую в этот момент вносились изменения, и получили ошибку\n\nsnaphot too old\n\nШо делать? (В будущем, чтобы такого не было)",
    "a": [
      "настроить корректное время undo retention",
      "гарантировать undo retention",
      "Уствновить корректный размер ТП undo"
    ],
    "v": [
      "Изменить автоматический undo на ручной",
      "установить корректные размеры файлов журналов redo log",
      "установить корректный размер ТП SYSTEM"
    ]
  },
  {
    "f": "Выполняется команда startup. Какой файл проверяется для определения состояния бд",
    "a": [
      "файл управления"
    ],
    "v": [
      "первый файл redo",
      "последний из созданных файлов архива",
      "файл данных, принадлежащий ТП SYSTEM"
    ]
  },
  {
    "f": "Таблицы customer и order часто используются в соединениях, что ведет к использованию сложных запросов. Вы создали представления для упрощения кода. Где будут храниться эти представления?",
    "a": [
      "в словаре данных (data dictotionary)"
    ],
    "v": [
      "в таблицах с информацией о производительности (performance tables)",
      "в пользовательских таблицах",
      "в сегментах для представлений",
      "в объектных сегментах",
      "в табличных сегментах"
    ]
  },
  {
    "f": "Вручную создан дополнительный листенер L1 для БД PROD, PAYDB и FINDB. При запуске L1 получается ошибка\nTNS12542:\nTNS:address already in use\nTNS:12560:\nTNS:protocol adapter error\nTNS00512:\nAddress already in use\n\nЧто делать, но так, чтобы остальное не упало? (один ответ)",
    "a": [
      "изменить номер порта на неиспользуемый и перезапустить процесс"
    ],
    "v": [
      "остановить все листенеры и перезапустить процесс",
      "установить значение для переменной окружения tns_admin",
      "остановить и перезапустить прослушивающий процесс",
      "изменить ip адрес хоста в файле listener.ORA и перезапустить процесс"
    ]
  },
  {
    "f": "БД находится в mount. Выполнена команда: alter database open;\n\nЧто произойдет? (несколько ответов)",
    "a": [
      "Будут открыты все redo журналы",
      "Будут открыты online файлы данных"
    ],
    "v": [
      "Будет открыт файл паролей",
      "Будет открыт файл параметров",
      "Будут открыты все файлы управления"
    ]
  },
  {
    "f": "Оказалось, что какой-то запрос работает долго из-за нехватки индексов. К какому советчику надо обратиться, чтобы узнать каких индексов не достает?",
    "a": [
      "SQL tuning advisor, SQL access advisor"
    ],
    "v": [
      "memory advisor",
      "segment advisor",
      "AWR",
      "ADDM"
    ]
  },
  {
    "f": "Советчик, используемый для анализа заданой SQL команды и генерации рекомендаций по повышению ее производительности",
    "a": [
      "SQL tuning advisor"
    ],
    "v": [
      "SQL repair advisor",
      "SQL optimizer",
      "SQL access advisor"
    ]
  },
  {
    "f": "Два верных утверждения о сегментах:",
    "a": [
      "Все данные в сегменте находятся в одном ТП",
      "Каждая секция в секционированной таблицк имеет собственный сегмент"
    ],
    "v": [
      "Если в таблицк три индекса, то только один сегмент используется для этих индексов",
      "Сегмент создается, когда экстент создается, изменяется или расширяется",
      "Каждая таблица в кластере имеет свой сегмент"
    ]
  },
  {
    "f": "Где можно найти информации об отсутствии файла redo?",
    "a": [
      "alert log"
    ],
    "v": [
      "event viewer",
      "audit trail",
      "trace file",
      "control file"
    ]
  },
  {
    "f": "Корректное утверждение про использование redo при восстановление БД (instance recovery)",
    "a": [
      "На основе редо файлов прозводится накат транзакций"
    ],
    "v": [
      "На основе редо файлов (и архивов) прозводится откат и накат транзакций",
      "На основе редо файлов прозводится откат транзакций",
      "На основе редо файлов прозводится откат и накат транзакций"
    ]
  },
  {
    "f": "БД открыта и листенер запущен. Новый админ бд остановил листенер с помощью команды:\nLSNRCTL>STOP\nЧто будет с сессиями, в рамках уже существующих подключений к экземпляру?",
    "a": [
      "Ничего не произойдет, можно будет работать дальше"
    ],
    "v": [
      "В рамках сессий можно будет выполнять только селекты",
      "Сессии будут завершены, а транзакции отменены",
      "В рамках сессий нельзя будет вополнить команды, пока не будет запущен листенер"
    ]
  },
  {
    "f": "-Бд открыта. Диск, на котором находится зеркалированный редо файл (один из членов группы), содержит поврежденные сектора, и вы не можете их восстановит\n\nЧто будет с бд?",
    "a": [
      "Никак не повлияет на работу экземпляра и БД"
    ],
    "v": [
      "Экземпляр станет невалидны и должен быть остановлен с abort",
      "Экземпляр будет остановлен в нормальном режиме",
      "База останется открытой, но LGWR не сможет работать",
      "БД останется открытой, потерянный файл будет пересоздан"
    ]
  },
  {
    "f": "Есть 3 листенера, какие опции можно использовать для равномерного распределения загрузки между соединениями?",
    "a": [
      "Пробовать случайно адреса, пока не получим соединение",
      "Использовать один, случайный адрес"
    ],
    "v": [
      "Пробовать каждый адрес по порядку, пока не получим соединение",
      "Использовать только первй адрес"
    ]
  },
  {
    "f": "Какое представление словаря данных следует использовать, чтобы получить список всех юзеров бд и их установки по умолчанию?",
    "a": [
      "DBA_USERS"
    ],
    "v": [
      "V$SESSION",
      "ALL_USERS",
      "USER_USERS"
    ]
  },
  {
    "f": "-Юзеры жалуются на медленное выполнение запросов. При исследовании проблемы было выяснено, что экземпляр не сконфигурирован для кэширования всех блоков данных, требующихся для запросов. Какой компонент оракла необходимо изменить для решения проблемы?",
    "a": [
      "database buffer cache"
    ],
    "v": [
      "streams pool",
      "redo log buffer",
      "large pool",
      "shared pool",
      "кэш словаря данных",
      "jave pool",
      "library cache"
    ]
  },
  {
    "f": "--SCOTT выполнил команды \nselect job from emp where job='clerk' for update of empno;\nSCOTT начал другую сессию. Какие три операции приведуь к ожиданию во второй сессии скотта?",
    "a": [
      "select job from emp where job='clerk' for update of empno;",
      "lock table emp in exclusive mode;",
      "lock table emp in share mode;"
    ],
    "v": [
      "insert into emp (empno, ename) values (1289, 'Dick');",
      "DELETE FROM emp WHERE job='MANAGER'"
    ]
  },
  {
    "f": "Экземпляер остановлен с опцией immediate. Какая будет правильная последовательность шагов при открытии БД?\n1) Выбеление SGA\n2) Чтение control file\n3) Чтение redo\n4) Запуск восстановления экземпляра\n5) Запуск фоновых процессов\n6) Проверка файлов данных на согласованность\n7) Чтение данных параметров",
    "a": [
      "7,1,5,2,3,6; шаг 4 не обязателен"
    ],
    "v": [
      "7,1,5,2,3,6,4",
      "1,2,3,5,6,4; 7 шаг не обязательный",
      "1,5,7,2,3,6; шаг 4 не обязательный"
    ]
  },
  {
    "f": "John использует следующиу команду для создания учетки:\ncreate ser john \nidentified by john \ntemporary tablespace temp_tbs\nquota 1m on system\nquota unlimited on data_tbs\nprofile apps_profile\npassword expire\ndefault role apps_dev_role\n\nПомесу ошибка?",
    "a": [
      "Нельзя определять роль в create_user"
    ],
    "v": [
      "Нельзя использовать QUOTA UNLIMITED в create user",
      "Нельзя определять password expire в create user",
      "Нельзя определять квоту на system для юзера",
      "Нельзя определять профиль для пользователя при помощи create user"
    ]
  },
  {
    "f": "Полный список логических структур хранения бд оракла?",
    "a": [
      "бд, ТП, сегменты, экстенты, блоки бд"
    ],
    "v": [
      "ТП, сегменты, экстенты, файлы данных, блоки бд",
      "ТП, сегменты, экстенты, файлы данных",
      "ТП, сегменты, экстенты,  блоки ос",
      "ТП, бд, сегменты, файлы данных, экстенты"
    ]
  },
  {
    "f": "-Какое преимущество дает увеличение undo-retention?",
    "a": [
      "согласованность при длительных транзакциях"
    ],
    "v": [
      "возможность параллельного доступа к данныи при обновлении большого кол-ва строк",
      "возможность отката длительных транзакций",
      "Возможность наката для повтора транзакций"
    ]
  },
  {
    "f": "-Вдруг обнаружилось, что REMOTE_OS_AUTHENT = TRUE. Зачем?",
    "a": [
      "Разрешить ос-аутентификацию для удаленого клиента"
    ],
    "v": [
      "Разрешить администрирование ос удаленым клиентом",
      "запретить администрировани ос удаленым клиентом",
      "разрешать выполнять операции запуска и остановки бд удаленым клиентам",
      "ограничить область администрирования одинаковыми ос"
    ]
  },
  {
    "f": "При создании нового юзера бд, вы не указали ТП по умолчанию. Юзер создал таблицу без указания табличного пространства. Где будет храниться таблица?",
    "a": ["постоянное ТП по умолчанию"],
    "v": [
      "В users",
      "undo",
      "временное ТП по умолчанию",
      "system",
      "sysaux",
      "index"
    ]
  },
  {
    "f": "Вдруг в БД информация изменяется неавторизованными пользователями. Вы ходите с помощью PL/SQL отслеживать все транзакции. Какие подпрограммы или конструкции PL/SQL необходимо использовать?",
    "a": [
      "триггеры"
    ],
    "v": [
      "пакеты",
      "анонимный PL/SQL блок",
      "процедуры",
      "функции"
    ]
  },
  {
    "f": "Какое утверждение о shared pool справедливо?",
    "a": [
      "shared pool содержит наиболее часто выполняемые команды SQL и наиболее запрашиваемые определения данных"
    ],
    "v": [
      "размер shared pool не может быть динамически изменен",
      "shared pool содержит только фиксированные структуры",
      "shared pool состоит из library cache и buffer cache"
    ]
  },
  {
    "f": "-Укажите 3 верных утверждения об удалении таблицы",
    "a": [
      "Cascade constraints необходима, если удаляемая таблица главная в связи",
      "При удалении таблицы ее исходное описани из словаря данных тоже удаляется",
      "При удалении с purge все экстенты таблицы освобождаются"
    ],
    "v": [
      "Индексы и триггеры на таблицу не удаляются, а помечаются как invalid",
      "Все синонимы для таблицы будут удалены"
    ]
  },
  {
    "f": "Чтобы создать реплику бд для тестовых целей? (Наиболее подходящий вариант)",
    "a": [
      "Использовать DBCA для шаблона текущей бд (структура + данные)"
    ],
    "v": [
      "Создать бд с помощью create database и вручную скопировать данные",
      "Использовать DBCA для шаблона текущей бд (структура), далее вручную скопировать данные через дата памп",
      "Использовать DBCA для шаблона текущей бд (структура)"
    ]
  },
  {
    "f": "1. Mount монтирует бд для определенных действий DBA, но не обеспечивает доступ юзеров\n2. NOMOUNT создает только database buffer cache, но не обеспечивает доступа к бд\n3. open обеспечивает юзерам доступ в бд\n4. startup запускает экземпляр\n\nКакие утрерждения верны (один ответ)",
    "a": [
      "1 and 3 true"
    ],
    "v": [
      "1 true 4 false",
      "1 false 4 true",
      "2 and 3 true",
      "2 false 4 false",
      "1 -false, 3 true"
    ]
  },
  {
    "f": "Установлено локальное управление экстентами для ТП. Как это повлияет на управление пространством?",
    "a": [
      "Для отслеживания свободных и занятых экстентов будет использована битовая карта"
    ],
    "v": [
      "Управление экстентами будет осуществляться из словаря данных",
      "Все экстенты будут одинакового размера",
      "ТП будет управляться системой и юзеры не смогут задать размер экстента"
    ]
  },
  {
    "f": "Имеется 3 бд на разных хостах в вашей среде разработки. Настройки сервера, такие как ip адрес и момер порта прослушивателя, часто меняются.\nКакой метод соединения надо использовать?",
    "a": [
      "Directory naming"
    ],
    "v": [
      "Easy connect",
      "Host naming",
      "Local naming"
    ]
  },
  {
    "f": "В БД параметр undo_retention имеет недостаточно большое значения для согласованности по чтению. Как можно его изменить?",
    "a": [
      "Путем выполнения команды Alter system..."
    ],
    "v": [
      "update для V$parameter с целью изменения undo_retention",
      "Путем выполнения команды Alter database... в состоянии mount",
      "Путем пересоздания управляющего файлы с новым значением undo_retention"
    ]
  },
  {
    "f": "В результате отказа носителя (media failure) был потерян один из файлов данных из ТП users и оно стало недоступно для юзеров. Что будет с БД?",
    "a": [
      "БД останется открытой"
    ],
    "v": [
      "БД перейдет в состояние \" только для чтения\"",
      "Статус БД определяется статусом ТП USERS",
      "БД будет размонтирована",
      "БД автоматически закроется",
      "БД будет остановлен в режиме abort"
    ]
  },
  {
    "f": "Вы намереваетесь перенести приложение из среды разработки в рабочую. Вы хотите, чтобы во время переноса объекта пользователся DEVUSER были перемещены в схему APPS.\nКакую опцию дата пампа необходимо использовать для решения этой задачи?",
    "a": [
      "remap_schema"
    ],
    "v": [
      "transform",
      "touser",
      "schemas",
      "owner",
      "remap_tablespace",
      "fromuser",
      "include",
      "remap_datafile",
      "reuse_datafiles"
    ]
  },
  {
    "f": "Какую команду следует выполнить для получения информации о кол-ве, именах, статусе и расположении файлов управления?",
    "a": [
      "select name, status from v$controlfile"
    ],
    "v": [
      "select name, status, location from v$control_files",
      "select status, location from v$parameter where parameter-control_files",
      "select name, status from v$parameters"
    ]
  },
  {
    "f": "В каких случаях LGWR производит запись из редо буфера в текущий журнал повтора?\n(2 варианта)",
    "a": [
      "перед записью из дата буффера в файлы",
      "подтверждение транзакции"
    ],
    "v": [
      "откат транзакции",
      "Буфер редо занят на 90+%",
      "буфер редо заполнен больше, чем на треть мегабайта"
    ]
  },
  {
    "f": "Запускается экземпляр с помощью init.ora. Как добавить еще один управляющий файл?",
    "a": [
      "Остановить экземпляр, скопировать управляющий файл в каталог, изменить параметр control_files в init.ora и открыть бд"
    ],
    "v": [
      "Остановить экземпляр. Запустить с mount. Скопировать управляющий файл, изменить значение параметра control_files в init.ora и открыть бд",
      "Скопировать управляющий файл в отдельны каталог, изменить параметр control_files в init.ora, перезапустить экземпляр и открыть бд",
      "Остановить экземпляр с abort, скопировать управляющий файл в каталог, изменить параметр control_files в init.ora и открыть бд",
      "Остановить экземпляр, скопировать управляющий файл в каталог и открыть бд"
    ]
  },
  {
    "f": "Какое представление словаря данных необходимо использовать для того, чтобы найти следующую информацию о пользователе:\n\n- истек ли срок использования пароля;\n- табличное пространство по умолчанию для пользователя;\n- имя профиля пользователя?",
    "a": [
      "только DBA_USERS"
    ],
    "v": [
      "DBA_USERS, DBA_TS_QUOTAS и DBA_PROFILES",
      "DBA_USERS и DBA_PROFILES",
      "DBA_USERS, DBA_TABLESPACES и DBA_PROFILES",
      "DBA_USERS и DBA_TABLESPACES"
    ]
  },
  {
    "f": "Отметьте корректное утверждение об анализе, осуществляемом монитором автоматическое диагностики базы данных (ADDM).",
    "a": [
      "Процесс анализа запускается автоматически после создания очередного снимка автоматического репозитория рабочей нагрузки (AWR)."
    ],
    "v": [
      "Результат анализа хранится в табличном пространстве SYSTEM, в таблицах, принадлежащих SYS.",
      "Результат анализа хранится в табличном пространстве SYSAUX, в таблицах, принадлежащих пользователю SYSMAN.",
      "Процесс анализа рекомендуется запускать (вручную) после создания очередного снимка автоматического репозитория рабочей нагрузки (AWR).",
      "Он не даёт отчёт о производительности SQL-команд.",
      "Результат анализа хранится в табличном пространстве SYSTEM, в таблицах, принадлежащих пользователю SYSMAN."
    ]
  },
  {
    "f": "Какой командой пользователь может перевести роль HR_CLERK в рабочее состояние?",
    "a": [
      "SET ROLE hr_clerk"
    ],
    "v": [
      "SET ENABLE ROLE hr_clerk",
      "CREATE ROLE hr_clerk",
      "ENABLE ROLE hr_clerk"
    ]
  },
  {
    "f": "При попытке подключения к БД была получена следующая ошибка:\nERROR:\nORA-12541:TNS:no_listener\n\nВы обнаружили, что прослушиватель не запущен и выполнили следующую команду для его запуска (с помощью утилиты Listener Control):\nlsnrctl> START\n\nОтметьте корректное утверждение.",
    "a": [
      "Будет предпринята попытка запуска прослушивателя по умолчанию (default listener)"
    ],
    "v": [
      "Будет показан список существующих прослушивателей и выдан запрос на ввод имени прослушивателя, который требуется запустить",
      "Будет запущен последний созданный прослушиватель"
    ]
  },
  {
    "f": "Отметьте корректное утверждение относительно использования журнала повторного выполнения (redo log) при восстановлении экземпляра БД (Instance recovery).",
    "a": [
      "На основе информации из оперативных (online) файлов журнала повторного выполнения производится \"накат\" (roll forward) транзакций"
    ],
    "v": [
      "На основе информации из оперативных (online) файлов журнала повторного выполнения производится откат (roll back) и \"накат\" (roll forward) транзакций",
      "На основе информации из оперативных (online) файлов журнала повторного выполнения производится откат (roll back) транзакций",
      "На основе информации из оперативных (online) и архивных файлов журнала повторного выполнения производится откат (roll back) транзакций"
    ]
  },
  {
    "f": "Один из пользователей базы данных PROD, Адамс, жалуется, что команда для обновления его таблицы TRANS выполняется слишком долго.\nВы обнаружили, что таблица была блокирована другим пользователем перед началом выполнения транзакции Адамса, и у Вас нет возможности связаться с этим пользователем.\nТ.к. Адамс пытается обновить некоторые важные данные, следует рассматривать его операцию как более приоритетную.\nКакой метод необходимо использовать для решения проблемы?",
    "a": [
      "Выполнить команду ALTER SYSTEM KILL SESSION..., чтобы убить блокирующую сессию"
    ],
    "v": [
      "Выполнить команду ALTER SYSTEM UNLOCK SESSION..., чтобы снять блокировку",
      "Выполнить команду ALTER SESSION UNLOCK..., чтобы снять блокировку",
      "Выполнить команду ALTER SESSION KILL..., чтобы убить блокирующую сессию",
      "Выполнить процедуру DBMS_SESSION.KILL_SESSION, чтобы убить блокирующую сессию"
    ]
  },
  {
    "f": "Вы хотите, чтобы в случае, если клиентские запросы на соединение не проходят по причине отсутствия ответа от прослушивателя, они были перенаправлены другому прослушивателю.\nЧто необходимо сделать?",
    "a": [
      "включить восстановление по времени соединения (connect-time failover)"
    ],
    "v": [
      "включить восстановление на уровне базы данных (database failover)",
      "настроить режим разделяемого сервера (shared server)",
      "включить восстановление на уровне экземпляра (instance failover)",
      "включить прозрачное восстановление приложений (Transparent Application Failover, TAF)"
    ]
  },
  {
    "f": "Укажите две ситуации, в которых произойдёт добавление записи в журнал уведомлений (alert log).",
    "a": [
      "Команда перестроения индекса ALTER INDEX .... REBUILD вернула ошибку \"ORA-01578: ORACLE data block corrupted (file #14, block #50)\"",
      "Запрос к таблице вернул ошибку \"ORA-600: Internal Error\""
    ],
    "v": [
      "Команда вставки данных в таблицу вернула ошибку \"ORA-00001: unique constraint (SYS.PK_TECHP) violated\"",
      "Команда вставки данных в таблицу вернула ошибку \"ORA-01722: Invalid Number\"",
      "Команда создания таблицы вернула ошибку \"ORA-00955: name is already used by existing object\""
    ]
  },
  {
    "f": "Вы обнаружили, что производительность снижается во время резервного копирования базы данных с помощью Recovery Manager (RMAN). База данных запущена в режиме разделяемого сервера (shared server). Экземпляром используется 60% общего объёма памяти ОС.\nВы подозреваете, что причиной снижения производительности является фрагментация разделяемого пула (shared pool). Что Вам следует предпринять для решения проблемы снижения производительности?",
    "a": [
      "Настроить большой пул (Large Pool), чтобы его мог использовать RMAN и разделяемый сервер (серверный процесс)"
    ],
    "v": [
      "Увеличить размер разделяемого пула с целью кеширования большего количества PL/SQL-объектов",
      "Увеличить размер буферного кэша базы данных для увеличения количества удачных считываний из кэша",
      "Увеличить общий размер системной глобальной области  (SGA) с целью увеличения количества удачных обращений к памяти",
      "Настроить пул Java с целью кэширования java-объектов",
      "Настроить пул потоков с целью разрешения параллельной обработки данных"
    ]
  },
  {
    "f": "Вам необходимо создать новую оптимизированную базу данных, которая будет использоваться финансовым приложением. Вы хотите, чтобы Oracle самостоятельно произвёл базовые настройки для оптимизации базы данных при её создании.\nКакой метод необходимо использовать?",
    "a": [
      "Использовать помощник по настройке базы данных (DBCA) для создания базы данных по шаблону \"Обработка транзакций\" (Transaction Processing)"
    ],
    "v": [
      "Использовать помощник по настройке базы данных (DBCA) для создания базы данных на основе файлов, управляемых Oracle (OMF)",
      "Использовать Enterprise Manager для создания новой базы данных с опцией онлайн обработки транзакций (OLTP)",
      "Использовать команду CREATE DATABASE .. для создания базы данных с файловой системой на основе автоматического управления пространством (ASM)",
      "Использовать команду CREATE DATABASE .. для создания базы данных на основе файлов, управляемых Oracle (OMF)"
    ]
  },
  {
    "f": "Вы хотите получать уведомления о том, что в критичном табличном пространстве занято 75% или более от всего выделенного пространства. Что необходимо сделать для этого?",
    "a": [
      "В Enterprise Manager Database Control установить порог предупреждения для табличного пространства, равный 75%"
    ],
    "v": [
      "Создать задание с помощью пакета DBMS_JOB для регулярной проверки свободного места в табличном пространстве",
      "С помощью команды ALTER TABLESPACE .. ADD THRESHOLD установить порог предупреждения для табличного пространства, равный 75%",
      "Запустить процедуру для проверки использования места в табличном пространстве",
      "Создать триггер, вызываемый при достижении требуемого порога использования места в табличном пространстве"
    ]
  },
  {
    "f": "Выберите два верных утверждения о местах хранения архивных файлов журнала повторного выполнения (archived redo log)",
    "a": [
      "Мест хранения архивных файлов журнала повторного выполнения можно задать не более 10",
      "Оперативные файлы всех групп журналов повторного выполнения архивируются одновременно"
    ],
    "v": [
      "Архивные файлы журналов могут быть сохранены только локально",
      "Число заданных мест хранения должно быть равно количеству процессов ARCn",
      "Архивный файл журнала должен писаться во все указанные места"
    ]
  },
  {
    "f": "Таблицы customer и order часто используются в соединениях, что ведёт к использованию сложных запросов. Вы создали представления для упрощения кода. Где будут храниться эти представления?",
    "a": [
      "в словаре данных (data dictionary)"
    ],
    "v": [
      "в таблицах с информациейо производительности (performance tables)",
      "в сегментах представлений",
      "в табличных сегментах",
      "в пользовательских таблицах",
      "в объектных сегментах"
    ]
  },
  {
    "f": "Пользователи Вашей базы данных PROD жалуются на медленное выполнение транзакций. Вы обнаружили, что транзакции долго ожидают, пока undo-сегменты станут доступными. Значение параметра undo_retention = 0.\nЧто необходимо предпринять для решения проблемы?",
    "a": [
      "увеличить размер табличного пространства хранения данных отмены"
    ],
    "v": [
      "увеличить undo_retention",
      "создать большее количество undo-сегментов",
      "создать ещё одно табличное пространство для хранения данных отмены"
    ]
  },
  {
    "f": "SID экземпляра Вашей БД - mydb. Каково будет имя по умолчанию для журнала уведомлений (alert log)?",
    "a": [
      "alert_mydb.log"
    ],
    "v": [
      "trace_alert_mydb.log",
      "alert:mydb.log",
      "alertlog_mydb.log",
      "alert_log_mydb.log",
      "mydb_alert_log.log"
    ]
  },
  {
    "f": "Какое преимущество даёт увеличение времени, в течение которого UNDO-данные хранятся в БД?",
    "a": [
      "Согласованность (read-consistency) данных, используемых в рамках длительных транзакций"
    ],
    "v": [
      "Возможность отката длительных транзакций",
      "Возможность параллельного доступа к данным при обновлении большого количества строк",
      "Возможность наката (roll forward) для повтора транзакций"
    ]
  },
  {
    "f": "Когда создается область SGA?",
    "a": [
      "при запуске экземпляра"
    ],
    "v": [
      "при старте серверного процесса",
      "при монтировании базы данных",
      "при запуске пользовательского процесса",
      "при создании базы данных"
    ]
  },
  {
    "f": "Одна из пользовательских сессий неожиданно прервалась во время выполнения транзакции. Какие действия по восстановлению будут выполнены СУБД Oracle?",
    "a": [
      "Будет произведён откат (roll back) транзакции с использованием undo-данных"
    ],
    "v": [
      "Для восстановления  будет использован журнал flashback (Flashback log)",
      "Будет произведён откат (roll back) транзакции с использованием информации из оперативных журналов повторного выполнения (online redo log)",
      "Будет произведён \"накат\" (roll forward) транзакции с использованием undo-данных",
      "Будет произведено восстановление экземпляра (Instance recovery) с помощью фонового процесса SMON"
    ]
  },
  {
    "f": "Вы обнаружили, что в Вашей БД информация о клиентах изменяется неавторизованными пользователями. Вы хотите с помощью PL/SQL отслеживать все транзакции для таблицы.\nКакой тип подпрограммы или конструкции PL/SQL необходимо использовать?",
    "a": [
      "триггеры БД"
    ],
    "v": [
      "пакеты",
      "функции",
      "анонимный PL/SQL блок",
      "процедуры"
    ]
  },
  {
    "f": "Вы создали табличное пространство SH_TBS. Табличное пространство состоит из двух файлов: sh_tbs_data1.dbf и sh_tbs_data2.dbf.\nЗатем Вы создали несекционированную таблицу SALES_DET в табличном пространстве SH_TBS.\nКакие утверждения справедливы? (Выберите два.)",
    "a": [
      "Сегмент создается при создании таблицы",
      "Головной блок сегмента содержит информацию о расположении экстентов в сегменте"
    ],
    "v": [
      "Сегмент создается при вставке первой строки в таблицу",
      "Вы можете определить имя файла данных, где сегмент должен быть сохранен"
    ]
  },
  {
    "f": "Вы создаете новую базу данных и не планируете назначать пользователям табличные пространства при создании, а также не хотите, чтобы пользователи использовали табличное пространство SYSTEM для выполнения операций сортировки. Что Вам следует сделать, чтобы предусмотреть эту ситуацию?",
    "a": [
      "Создать временное табличное пространство по умолчанию"
    ],
    "v": [
      "Создать табличное пространство с ключевым словом TEMPORARY",
      "Создать undo tablespace",
      "Создать табличное пространство с ключевым словом UNDO"
    ]
  },
  {
    "f": "Проанализируйте код:\n\nCREATE OR REPLACE TRIGGER update_emp\nAFTER UPDATE ON emp\nBEGIN\nINSERT INTO audit_table(who, dated)\nVALUES(USER,SYSDATE);\nEND;\n\nВы выполняете команду UPDATE таблицы EMP, в результате чего изменяется 10 строк. Сколько строк будет занесено в таблицу AUDIT_TABLER?",
    "a": [
      "1."
    ],
    "v": [
      "Не будет занесено.",
      "10.",
      "Количество строк, равное количеству строк в таблицу EMP."
    ]
  },
  {
    "f": "Отметьте две характеристики БД, в которой возможно создание только согласованной резервной копии (consisten backup).",
    "a": [
      "Вы работаете с БД, которая находится в режиме NOARCHIVELOG",
      "Вы работаете с БД, где простой допустим"
    ],
    "v": [
      "Вы работаете с БД, в которой все табличные пространства являются локально управляемыми",
      "Вы работаете с БД, которая находится в режиме ARCHIVELOG",
      "Вы работаете с БД, в которой управляющие файлы и файлы журнала повторного выполнения (redo log) мультиплексированы",
      "Вы работаете с БД, где не допускается простой"
    ]
  },
  {
    "f": "Вы намереваетесь создать БД с помощью Database Configuration Assistant (DBCA) с учётом следующих требований:\n- приложения будут соединяться с БД через промежуточное звено (middle tier);\n- количество одновременных подключений ожидается большим;\n- планируется выполнение различных задач: как обработка транзакций, так и выполнение (по ночам) сложных BI-запросов.\nКакую опцию DBCA следует выбрать при создании БД?",
    "a": [
      "шаблон General Purpose, режим \"разделяемого\" сервера (shared server), включить  Automatic Manary Management (AMM)"
    ],
    "v": [
      "шаблон General Purpose, оставить предложенный по умолчанию объём памяти",
      "оставить настройки по умолчанию",
      "шаблон Data Warehouse, режим \"выделенного сервера\" (dedicated server), включить Automatic Manary Management (AMM)"
    ]
  },
  {
    "f": "В Вашей рабочей базе данных необходимо немедленно увеличить размер буферного кэша БД и оставить установленное значение для последующих запусков экземпляра. Экземпляр настроен таким образом, чтобы учитывать любые изменения размеров структур памяти. Т.к. база данных - рабочая, Вы планируете решить проблему, не затрагивая пользовательские соединения.\nЧто из нижеперечисленного должно быть выполнено для успешного решения поставленной задачи?",
    "a": [
      "Экземпляр должен быть запущен с использованием SP-файла (server parameter file)."
    ],
    "v": [
      "Экземпляр должен быть запущен в ограниченом режиме (restricted mode)",
      "Экземлпяр должен быть запущен, но не открыт",
      "Экземпляр должен быть запущен, но не смонтирован",
      "Экземпляр должен быть запущен в обычном режиме (normal mode)"
    ]
  },
  {
    "f": "Пользователи подключаются к базе данных PROD, используя различные приложения и тем самым снижая производительность БД. Старший администратор базы данных предположил, что первопричина низкой производительности заключается в большом количестве одновременных (конкурентных) соединений и попросил Вас ограничить количество одновременно устанавливаемых соединений до одного пользователя.\nЧто необходимо предпринять для решения этой задачи?",
    "a": [
      "Установить значение параметра SESSIONS_PER_USER равным 1 в профиле / профилях пользователей БД"
    ],
    "v": [
      "Присвоить параметру SESSIONS значение 1 (в файле параметров)",
      "Выдать привилегию RESTRICTED SESSION всем пользователям БД",
      "Выдать привилегию SINGLE SESSION всем пользователям БД",
      "Создать роль, выдать ей привилегию SINGLE SESSION и назначить эту роль всем пользователям БД"
    ]
  },
  {
    "f": "Ваша база данных находится в режиме ARCHIVELOG. Файл данных, расположенный в табличном пространстве SYSTEM был повреждён. До какого момента можно восстановить базу с использованием резервной копии?",
    "a": [
      "До момента завершения последней транзакции (последнего выполнения команды commit)"
    ],
    "v": [
      "До момента начала операции восстановления",
      "До момента начала последней транзакции",
      "До момента, когда файл был повреждён",
      "Табличное пространство SYSTEM восстановить нельзя, необходимо пересоздать базу"
    ]
  },
  {
    "f": "Укажите два верных утверждения о представлениях словаря данных с префиксом USER_.",
    "a": [
      "Пользователи, которые имеют системную привилегию CREATE PUBLIC SYNONYM могут создавать общедоступные синонимы для этих представлений",
      "Столбец OWNER содержит информацию о текущем пользователе"
    ],
    "v": [
      "Пользователи могут выполнять команду INSERT к этим представлениям для того, чтобы изменить значения в соответствующих таблицах",
      "Определения этих представлений хранятся в табличном пространстве пользователя по умолчанию",
      "Пользователь должен иметь системную привилегию SELECT ANY TABLE для просмотра этих представлений",
      "Эти представления сожержат информацию обо всех объектах, к которым у пользователя есть права на доступ"
    ]
  },
  {
    "f": "Ваша база данных функционирует в режиме NOARCHIVELOG. С момента создания последней автономной резервной копии (offline backup) прошлой ночью оперативные файлы журнала повторного выполнения, входящие в группу 1, были дважды перезаписаны.\nСегодня утром файл данных, принадлежащий табличному пространству SYSTEM, был повреждён. До состояния на какой момент времени он может быть восстановлен?",
    "a": [
      "На момент создания последней автономной резервной копии (прошлой ночью)"
    ],
    "v": [
      "На момент последнего коммита",
      "Он не может быть восстановлен",
      "На момент начала последней транзакции"
    ]
  },
  {
    "f": "Что из нижеперечисленного выполняет фоновый процесс?",
    "a": [
      "Копирование содержимого оперативных журналов повторного выполнения (online redo log) в отдельное, офлайн, хранилище."
    ],
    "v": [
      "Создание соединений в режиме \"выделенного сервера\" (dedicated server)",
      "Установка соединения между клиентским процессом и диспетчером",
      "Выполнение кода PL/SQL"
    ]
  },
  {
    "f": "Фоновый процесс Database Writer (DBWn) записывает \"гразные\" буферы из буферного кэша базы данных (database buffer cache) в _____.",
    "a": [
      "только файлы данных"
    ],
    "v": [
      "в файлы данных, файлы журналов повтора и файлы управления",
      "только в файлы данных и файлы журналов повтора",
      "только в файлы данных и файлы управления"
    ]
  },
  {
    "f": "Укажите два верных утверждения об отношении между файлами данных и логическими структурами БД.",
    "a": [
      "Файл данных может принадлежать только одному табличному пространству.",
      "Один экстент не может быть распределён по разным файлам данных."
    ],
    "v": [
      "В файле данных может находиться только один сегмент.",
      "Один сегмент не может быть распределён по разным файлам данных.",
      "Блок данных может быть распределён по разным файлам данных, т.к. он состоит из нескольких блоков операционной системы."
    ]
  },
  {
    "f": "Какой вариант запуска экземпляра является правильным, если требуется создать базу данных?",
    "a": [
      "STARTUP NOMOUNT"
    ],
    "v": [
      "STARTUP OPEN",
      "STARTUP",
      "STARTUP MOUNT"
    ]
  },
  {
    "f": "Основываясь на следующих ограничениях профиля, если пользователь попытается подключиться и ошибается в пяти попытках, как долго он должен будет ждать прежде, чем сможет подключиться снова?\n\nALTER PROFILE DEFAULT LIMIT\nPASSWORD_LIFE_TIME 60\nPASSWORD_GRACE_TIME 10\nPASSWORD_REUSE_TIME 1800\nPASSWORD_REUSE_MAX UNLIMITED\nFAILED_LOGIN_ATTEMPTS 5\nPASSWORD_LOCK_TIME 1/1440\nPASSWORD_VERIFY_FUNCTION verify_function;",
    "a": [
      "1 минута"
    ],
    "v": [
      "60 минут",
      "5 минут",
      "10 минут",
      "18 минут",
      "14 минут"
    ]
  },
  {
    "f": "Отметьте ошибочное утверждение об утилите Oracle Data Pump Export",
    "a": [
      "Можно указывать полный путь до файла дампа"
    ],
    "v": [
      "Можно экспортировать часть таблицы",
      "Можно указывать количество для обработки задачи"
    ]
  },
  {
    "f": "Какая структура хранения используется для физического хранения строк нескольких таблиц в одном блоке?",
    "a": [
      "Кластеризованная таблица"
    ],
    "v": [
      "Индексно-организованная таблица",
      "Некластерная таблица",
      "Секционированная таблица"
    ]
  },
  {
    "f": "Имеется текстовый файл, содержащий информацию о тысяче позиций. Приложение конечного пользователя требует загрузки этой информации в таблицу базы данных.\nКакие два инструмента можно использовать для решения этой задачи?",
    "a": [
      "SQL*Loader",
      "Внешние таблицы"
    ],
    "v": [
      "Data Pump",
      "Oracle Text",
      "Oracle Import"
    ]
  },
  {
    "f": "Какие два из нижеперечисленных действий производятся при первом (после старта экземпляра) выполнении любой команды UPDATE?",
    "a": [
      "Запись изменённых данных в архивные файлы журналов повтора",
      "Обновление управляющего файла с целью отметки последней контрольной точки"
    ],
    "v": [
      "Создание дерево синтаксического разбора команды",
      "Считывание блоков в буферный кэш базы данных (если их там ещё нет)",
      "Обновление заголовка файла данных с целью отметки последней контрольной точки",
      "Запись изменённых блоков в файлы данных"
    ]
  },
  {
    "f": "Какие утверждения о сегментах справедливы? (Выберите два)",
    "a": [
      "Каждая секция в секционированной таблице имеет собственный сегмент",
      "Все данные в сегменте должны храниться в одном табличном пространстве"
    ],
    "v": [
      "Каждая таблица в кластере имеет собственный сегмент",
      "Если таблица имеет три индекса, то только один сегмент используется для этих индексов",
      "Сегмент создается, когда экстент создается, изменяется или расширяется"
    ]
  },
  {
    "f": "БД была окрыта, когда произошёл отказ носителя (media failure), приведший к потере всех управляющих файлов. Отметьте верное для данной ситуации утверждение.",
    "a": [
      "Экземпляр будет автоматически остановлен в режиме abort"
    ],
    "v": [
      "Экземпляр должен быть остановлен",
      "Экземпляр останется в открытом состоянии",
      "Экземеляр останется в открытом состоянии, но все фоновые процессы будут перезапущены",
      "Экземпляр будет находиться в открытом, но нерабочем состоянии",
      "Экземпляр \"зависнет\""
    ]
  },
  {
    "f": "John использует следующую команду для создания новой учетной записи:\n\nCREATE USER john\nIDENTIFIED BY john\nTEMPORARY TABLESPACE temp_tbs\nQUOTA 1M ON system\nQUOTA UNLIMITED ON data_tbs\nPROFILE apps_profile\nPASSWORD EXPIRE\nDEFAULT ROLE apps_dev_role;\n\nПочему приведенная выше команда возвращает ошибку?",
    "a": [
      "Вы не можете определять роль для пользователя при помощи команды CREATE USER"
    ],
    "v": [
      "Вы не можете предоставлять параметр QUOTA UNLIMITED в команды CREATE USER",
      "Вы не можете определять квоту на табличное пространство SYSTEM для пользователя",
      "Вы не можете определять профиль для пользователя при помощи команды CREATE USER",
      "Вы не можете определять раздел PASSWORD EXPIRE в команде CREATE USER"
    ]
  },
  {
    "f": "Вы работаете с сервером Oracle Database 11g, где на данный момент установлено только серверное ПО и не создано ни одной БД. Вы планируете создать БД с использованием Database Configuration Assistant (DBCA).\nКакие из нижеперечисленных требований могут быть выполнены с помощью DBCA?",
    "a": [
      "настройка ежедневного резервного копирования БД с размещением бэкапов в области мгновенного восстановления (flash recovery area)",
      "использование Automatic Storage Management (ASM) для хранения файлов БД",
      "активация Enterprise Manager Database Control для управления БД",
      "настройка базы для функционирования в режиме \"разделяемого сервера\" (shared server)",
      "отключение автоматического выполнения задач обслуживания (automatic maintenance tasks), таких как сбор статистики оптимизатора"
    ],
    "v": [
      "настройка метода разрешения имён (naming methods) для подключения пользователей к БД по сети"
    ]
  },
  {
    "f": "Укажите советчик, используемый с целью анализа заданной (single) SQL-команды и генерации рекомендаций по повышению её производительности.",
    "a": [
      "SQL Tuning Advisor"
    ],
    "v": [
      "SQL Repair Advisor",
      "SQL Access Advisor",
      "SQL Optimizer"
    ]
  },
  {
    "f": "Вас попросили изучить рабочий сервер БД и составить отчёт о настройках, сделанных предыдущим администратором БД. В процессе Вы обнаружили следующую запись в файле параметров:\n\nREMOTE_OS_AUTHENT = TRUE\n\nКакова могла быть цель установки такого значения параметра?",
    "a": [
      "разрешить ОС-аутентификацию для удалённого клиента"
    ],
    "v": [
      "запретить администрирование ОС удалённым клиентом",
      "ограничить область администрирования одинаковыми ОС",
      "разрешить выполнять операции запуска и остановки БД удалённым клиентом",
      "разрешить администрирование ОС удалённым клиентом"
    ]
  },
  {
    "f": "Какие две опции используются для обеспечения отказоустойчивости по времени соединения (connect-time failover)?",
    "a": [
      "Пробовать все адреса по порядку, пока какой-то из прослушивателей не ответит",
      "Пробовать все адреса в случайном порядке, пока какой-то из прослушивателей не ответит"
    ],
    "v": [
      "Использовать случайно выбранный адрес",
      "Пройти все адреса по заданному маршруту, пока не будет достигнут конечный",
      "Использовать только первый адрес (прослушивателя)"
    ]
  },
  {
    "f": "В Вашей БД для параметра UNDO_RETENTION установлено значение 1000, но период удержания данных отмены (undo retention) не является гарантированным. Отметьте корректное утверждение.",
    "a": [
      "Зафиксированные (commited) данные будут удерживаться ещё в течение 1000 секунд при наличии доступного свободного пространства"
    ],
    "v": [
      "Данные отмены устаревают каждые 1000 секунд",
      "Зафиксированные (commited) данные отмены будут удерживаться в табличном пространстве UNDO ещё в течение 1000 секунд, а затем будут перемещены во временное табличное пространство для обеспечения согласованности по чтению (read consistency)",
      "Данные отмены становятся постоянными спустя 1000 секунд после создания",
      "Данные отмены обновляются каждые 1000 секунд"
    ]
  },
  {
    "f": "Ваша база функционирует в режиме NOARCHIVELOG. Какой тип резервного копирования Вам доступен в данном случае?",
    "a": [
      "Согласованное (consistent backup)"
    ],
    "v": [
      "Онлайн (online backup)",
      "Несогласованное (inconsistent backup)",
      "Горячее (hot backup)"
    ]
  },
  {
    "f": "Вы установили следующие пороговые значения для табличного пространства USERS (Tablespace Full Metrics Threshold):\nWarning (%): 90\nCritical (%): 95\nКакой фоновый процесс ответственнен за выдачу уведомлений при достижении этих пороговых значений?",
    "a": [
      "Manageability Monitor process (MMON)"
    ],
    "v": [
      "Process Monitor process (PMON)",
      "System Monitor process (SMON)",
      "Memory Manager process (MMAN)"
    ]
  },
  {
    "f": "Вы используете неструктурированные файлы (flat files) в качестве источника для одного из ваших приложений на основе хранилищ данных. Для повышения производительности приложения было решено переместить информацию из неструктурированных файлов в базу данных Oracle, в т.ч. в кластеризованные таблицы.\nНеобходимо оптимизировать операцию загрузки, чтобы миграция данных оказала минимальное влияние на производительность базы.\nКакой метод необходимо использовать для загрузки?",
    "a": [
      "использовать утилиту SQL*Loader и условный путь (conventional path) для загрузки данных"
    ],
    "v": [
      "использоваь утилиту SQL*Loader и прямой путь (direct path) для загрузки данных",
      "заполнить внешнюю таблицу",
      "использовать утилиту экспорта/импорта Oracle Data Pump"
    ]
  },
  {
    "f": "Файл данных табличного пространства SYSTEM был поврежден, резервное копирование не производилось. Как можно восстановить повреждённый файл?",
    "a": [
      "Файл данных не может быть восстановлен"
    ],
    "v": [
      "Выполнить команду ALTER DATABASE CREATE DATAFILE",
      "Файл данных может быть восстановлен из автоматически созданной резервной копии табличного пространства SYSTEM",
      "Запустить Recovery Manager (RMAN)",
      "Перевести табличное пространство в режим offline, удалить и пересоздать его."
    ]
  },
  {
    "f": "При настройке рабочей базы данных Вам потребовалось создать пользователя, отвечающего следующим требованиям:\n1. объекты, создаваемые пользователем, должны храниться в табличном пространстве TBS1, если при создании не было явно указано табличное пространство;\n2. пользователь должен иметь возможность использовать не более 10 Мб в табличном пространстве TBS1;\n3. пользователь должен сменить пароль после первого входа в систему.\nКакие три опции Вы должны задать при выполнении команды CREATE USER для выполнения этих требований?",
    "a": [
      "PASSWORD EXPIRE",
      "QUOTA 10MB ON TBS1",
      "DEFAULT TABLESPACE TBS1"
    ],
    "v": [
      "ACCOUNT UNLOCK",
      "ACCOUNT LOCK",
      "PROFILE",
      "QUOTA UNLIMITED ON TBS1",
      "TEMPORARY TABLESPACE TEMP",
      "PASSWORD NEVER EXPIRE",
      "TEMPORARY TABLESPACE SYSTEM"
    ]
  },
  {
    "f": "Пароль, задаваемый во время создания новых пользователей или изменении пароля для существующих должен удовлетворять следующим требованиям:\na) содержать как минимум 5 символов, из которых хотя бы один - буква в верхнем регистре, один - цифра и один - специальный символ;\nb) отличаться от предыдущего пароля;\nc) не совпадать с логином.\nЧто необходимо сделать для проверки пароля на соблюдение этих требований?",
    "a": [
      "профиль, предусматривающий функцию проверки пароля"
    ],
    "v": [
      "заданный пользователем PL/SQL блок",
      "процедуру проверки пароля Oracle, используемую по умолчанию",
      "триггер",
      "добавить имя процедуры, проверяющий пароль, в команду CREATE USER"
    ]
  },
  {
    "f": "Вы обнаружили, что пользователи, обладающие ролью DBA, используют больше ресурсов процессора (CPU), чем установлено в назначенном им профиле. Что нужно сделать для включения ресурсных ограничений?",
    "a": [
      "Установить значение TRUE для параметра RESOURCE_LIMIT"
    ],
    "v": [
      "Отозвать у этих пользователей роль DBA и выдать роли CONNECT и RESOURCE",
      "Назначить этим пользователям профиль DEFAULT",
      "Создать новый профиль с ограничениями на использованием CPU и назначить его этим пользователям"
    ]
  },
  {
    "f": "Вы выполнили команду STARTUP MOUNT. Для чего может понадобиться смонтировать базу данных, но не открывать?",
    "a": [
      "включение или отключение архивации журналов повтора"
    ],
    "v": [
      "переименование управляющих файлов",
      "удаление табличного пространства базы данных",
      "удаление пользователя базы данных",
      "пересоздание управляющих файлов после их полной потери"
    ]
  },
  {
    "f": "Укажите два справедливых утверждения о фоновом процессе Database Writer (DBWn).",
    "a": [
      "Возможно настроить несколько фоновых процессов Database Writer для экземпляра Oracle.",
      "Он записывает \"грязные\" буферы (при их наличии) в файлы данных в ходе выполнения контрольной точки (checkpoint)."
    ],
    "v": [
      "Он записывает \"грязные\" буферы (при их наличии) в файлы данных по завершении (commit) каждой транзакции.",
      "Он записиывает \"грязные\" буферы (при их наличии) в файлы данных перед тем, как Log Writer (LGWR) начинает запись.",
    ]
  },
  {
    "f": "Изучите команду SQL:\n\nCREATE TABLESPACE user_data\nDATAFILE '%Oracle_Home%\\oradata\\user_data_01.dbf' SIZE 100M\nLOCALLY MANAGED UNIFORM SIZE 1M\nAUTOMATIC SEGMENT SPACE MANAGEMENT;\n\nКакая часть табличного пространства будет иметь постоянный размер 1M?",
    "a": [
      "экстент"
    ],
    "v": [
      "блок Oracle",
      "блок операционной системы",
      "сегмент"
    ]
  },
  {
    "f": "Выберите три верных утверждения о словаре данных базы Oracle.",
    "a": [
      "Согласованность по чтению не гарантируется для операций SELECT на представлениях словаря данных",
      "В нём содержатся метаданные о пользователях, объектах, ограничениях и их расположении",
      "Его владельцем является пользователь SYS"
    ],
    "v": [
      "Он обновляется автоматически сервером Oracle при изменении определений объектов",
      "Вносить изменения в него следует напрямую - с помощью SQL-команд"
    ]
  }
]